{
  "C01B": "Purification or separation of specific gases",
  "C01C": "Cyanogen; Compounds thereof",
  "C01D": "Rubidium, caesium or francium compounds",
  "C01F": "Compounds of rare earth metals",
  "C01G": "Subject matter not provided for in other groups of this subclass",
  "C01P": "Physical properties of inorganic compounds",
  "C02F": "Location of water treatment or water treatment device",
  "C03B": "Transporting hot glass sheets during their manufacture",
  "C03C": "Methods for coating glass",
  "C04B": "Organisational aspects of production methods, equipment or plants",
  "C05B": "Granulation or pelletisation of phosphatic fertilisers, other than slag (granulating apparatus B01J2/00; granulating slag C04B)",
  "C05C": "Other nitrogenous fertilisers",
  "C05D": "Other inorganic fertilisers",
  "C05F": "Preparation of fertilisers characterised by biological or biochemical treatment steps, e.g. composting or fermentation",
  "C05G": "Fertilisers characterised by their form",
  "C06B": "Use of single substances as explosives",
  "C06C": "Pyrophoric compositions; Flints (chemical lighters C06C9/00; alloys in general C22C)",
  "C06D": "Compositions for gas-attacks",
  "C06F": "Matches (match-books A24F27/12)",
  "C07B": "Indexing scheme relating to specific properties of organic compounds",
  "C07C": "Fullerenes, e.g. C60 buckminsterfullerene or C70",
  "C07D": "Heterocyclic compounds containing unspecified hetero rings",
  "C07F": "Metal compounds according to more than one of main groups C07F1/00 - C07F17/00",
  "C07G": "{Other compounds of unknown constitution}",
  "C07H": "Subject matter not provided for in other groups of this subclass",
  "C07J": "Processes for the preparation of steroids in general",
  "C07K": "Fusion polypeptide",
  "C08B": "Preparation of polysaccharides not provided for in groups C08B1/00 - C08B35/00; Derivatives thereof (cellulose D21; {microbiological processes C12P})",
  "C08C": "Chemical modification of rubber",
  "C08F": "Chemical modification of a polymer",
  "C08G": "Macromolecular compounds obtained by reactions forming an ether link in the main chain of the macromolecule",
  "C08H": "Subject matter not provided for in other groups of this subclass {, e.g. flours, kernels}",
  "C08J": "Characterised by the use of natural macromolecular compounds or of derivatives thereof not provided for in groups C08J2401/00 - C08J2407/00 or C08J2489/00 - C08J2497/00",
  "C08K": "Specific properties of additives",
  "C08L": "Composition of polymers characterized by a further compound in the blend, being organic macromolecular compounds, natural resins, waxes or and bituminous materials, non-macromolecular organic substances, inorganic substances or characterized by their function in the composition",
  "C09B": "Dyes not provided for by a single group of this subclass",
  "C09C": "Methods of preparing the interference pigments",
  "C09D": "Coating compositions based on unspecified macromolecular compounds",
  "C09F": "Preparation of French polish",
  "C09G": "Ski waxes",
  "C09H": "{Adhesives based on glue or gelatine}",
  "C09J": "Presence of natural macromolecular compounds or on derivatives thereof, not provided for in groups C09J2489/00 - C09J2497/00",
  "C09K": "Functional layers of liquid crystal optical display excluding electroactive liquid crystal layer characterised by chemical composition",
  "C10B": "Other processes not covered before; Features of destructive distillation processes in general",
  "C10C": "Production of pyroligneous acid {distillation of wood, dry distillation of organic waste}(carbonisation of wood C10B)",
  "C10F": "Working-up peat (extracting wax from peat C10G)",
  "C10G": "Products obtained by processes covered by groups C10G9/00 - C10G69/14",
  "C10H": "Details of acetylene generators; Accessory equipment for, or features of, the wet production of acetylene",
  "C10J": "Details of gasification processes",
  "C10K": "Modifying the chemical composition of combustible gases containing carbon monoxide to produce an improved fuel, e.g. one of different calorific value, which may be free from carbon monoxide",
  "C10L": "Mixture of two or more additives covered by the same group of C10L1/00 - C10L1/308",
  "C10M": "Mixtures of base materials or thickeners or additives",
  "C10N": "Special pretreatment of the material to be lubricated, e.g. phosphatising or chromatising of a metal",
  "C11B": "Solidifying fatty oils, fats, or waxes by physical processes",
  "C11C": "Candles",
  "C11D": "Recovery of glycerol from a saponification liquor (refining glycerol C07C31/22)",
  "C12C": "Special features",
  "C12F": "Preparation of denatured alcohol",
  "C12G": "Special features",
  "C12H": "Methods for increasing the alcohol content of fermented solutions or alcoholic beverages",
  "C12J": "Vinegar; Preparation or purification thereof",
  "C12L": "Cellar tools",
  "C12M": "{Subject matter not otherwise provided for in other groups of this subclass}",
  "C12N": "Further aspects of viruses or vectors not covered by the C12N2700/00 or C12N2800/00 series",
  "C12P": "Fermentation products obtained from optionally pretreated or hydrolyzed cellulosic or lignocellulosic material as the carbon source (ethanol C12P7/10)",
  "C12Q": "Oligonucleotides characterized by their use",
  "C12R": "Microorganisms {; Processes using microorganisms}",
  "C12Y": "Ligases forming nitrogen-metal bonds (6.6)",
  "C13B": "Subject matter not provided for in other groups of this subclass",
  "C13K": "Sugars not otherwise provided for in this class",
  "C14B": "Mechanical treatment or processing of skins, hides or leather in general; Pelt-shearing machines; Making driving belts; Machines for splitting intestines",
  "C14C": "Subject matter not provided for in other groups of this subclass",
  "C21B": "Treatment of slags originating from iron or steel processes",
  "C21C": "Process aspects",
  "C21D": "Making use of special physico-chemical means",
  "C22B": "Obtaining metals not elsewhere provided for in this subclass (iron C21)",
  "C22C": "End product comprising different layers, coatings or parts of cermet",
  "C22F": "Changing the physical structure of non-ferrous metals or alloys by special physical methods, e.g. treatment with neutrons",
  "C23C": "Aspects relating to chemical surface treatment of metallic material by reaction of the surface with a reactive medium",
  "C23D": "De-enamelling",
  "C23F": "Aspects of inhibiting corrosion of metals by anodic or cathodic protection",
  "C23G": "Cleaning or de-greasing metallic material by other methods; Apparatus for cleaning or de-greasing metallic material with organic solvents",
  "C25B": "Operating or servicing cells",
  "C25C": "Constructional parts, or assemblies thereof, of cells; Servicing or operating of cells (for the production of aluminium C25C3/06 - C25C3/22)",
  "C25D": "Processes for servicing or operating cells for electrolytic coating",
  "C25F": "Constructional parts, or assemblies thereof, of cells for electrolytic removal of material from objects (for both electrolytic coating and removal C25D); Servicing or operating",
  "C30B": "Apparatus in general, specially adapted for the growth, production or after-treatment of single crystals or a homogeneous polycrystalline material with defined structure",
  "C40B": "Subject matter not provided for in other groups of this subclass",
  "C99Z": "Subject matter not otherwise provided for in this section",
  "D01B": "Other mechanical treatment of natural fibrous or filamentary material to obtain fibres or filaments",
  "D01C": "Carbonising rags, {threads or fabrics} to recover animal fibres, {i.e. chemical removal of vegetable impurities (treatment of threads or fabrics of animal fibres for other purposes than removal of vegetable impurities D06L or D06M)}",
  "D01D": "Complete machines for producing artificial threads",
  "D01F": "Recovery of starting material, waste material or solvents during the manufacture of artificial filaments or the like",
  "D01G": "Subject matter not provided for in other groups of this subclass",
  "D01H": "Spinning or twisting machines; Drafting devices",
  "D02G": "Yarns or threads, e.g. fancy yarns; Processes or apparatus for the production thereof, not otherwise provided for (for producing crimped or curled yarns D02G1/00)",
  "D02H": "Details of machines of the preceding groups",
  "D02J": "Heating or cooling the yarn, thread, cord, rope, or the like, not specific to any one of the processes provided for in this subclass (heating, cooling or drying during spinning or twisting D01H; drying of yarns or the like, in general F26B)",
  "D03C": "Shedding mechanisms",
  "D03D": "Driving, starting, or stopping arrangements; Automatic stop motions {(loom control associated with fabric inspection on the loom D03J1/007)}",
  "D03J": "Auxiliary apparatus associated with looms; Weavening combined with other operations; Shuttles",
  "D04B": "Miscellaneous knitting processes, apparatus, or machines, not otherwise provided for",
  "D04C": "Tools or apparatus for braiding or lacing by hand",
  "D04D": "Ribbon-threading apparatus or devices (needles D05B)",
  "D04G": "Other knotting",
  "D04H": "Needling machines",
  "D05B": "Hand sewing processes or apparatus for special work or not otherwise provided for",
  "D05C": "Embroidered or tufted products; Base fabrics specially adapted for embroidered work; Inserts for producing surface irregularities in embroidered products (layered products B32B; non-woven pile fabrics D04H11/00)",
  "D05D": "Operations on the work before or after sewing",
  "D06B": "Treating of textile materials, e.g. bleaching, dyeing, mercerising, impregnating, washing; Fulling of fabrics",
  "D06C": "Finishing or decoration of textile materials, except for bleaching, dyeing, printing, mercerising, washing or fulling",
  "D06F": "Liquid or energy recovery arrangements",
  "D06G": "Mechanical, vacuum, or pressure cleaning in combination with the turning inside-out of flexible tubular or other hollow articles",
  "D06H": "Inspecting textile materials",
  "D06J": "Pleating, kilting or goffering textile fabrics or wearing apparel",
  "D06L": "Bleaching fibres, filaments, threads, yarns, fabrics, feathers or made-up fibrous goods; Bleaching leather or furs",
  "D06M": "Specific information on the treatment or the process itself not provided in D06M23/00-D06M23/18",
  "D06N": "Others characteristics",
  "D06P": "Dyeing or printing processes combined with mechanical treatment",
  "D06Q": "Decorating textiles",
  "D07B": "Linked indexing codes associated with indexing codes or classes of D07B",
  "D10B": "Medical; Hygiene",
  "D21B": "Fibrous raw materials or their mechanical treatment (pretreatment of the finely-divided materials before digesting D21C1/00; methods of beating or refining pulp D21D1/00; purification of the pulp suspension by mechanical means D21D5/00)",
  "D21C": "Regeneration of pulp liquors {or effluent waste waters}",
  "D21D": "Subject matter not provided for in other groups of this subclass",
  "D21F": "Making discontinuous sheets of paper, pulpboard or cardboard, or of wet web, for fibreboard production (making discontinuous sheets of board in moulds D21J; drying paper, pulpboard, or cardboard, in discontinuous sheet form F26B)",
  "D21G": "Other accessories for paper-making machines",
  "D21H": "Special paper not otherwise provided for, e.g. made by multi-step processes",
  "D21J": "Manufacture of hollow articles from fibre suspensions or papier-mâché by deposition of fibres in or on a wire-net mould",
  "D99Z": "Subject matter not otherwise provided for in this section",
  "A01B": "Methods for working soil (essentially requiring the use of particular machines, see the relevant groups for the machines)",
  "A01C": "Distributing devices specially adapted for liquid manure or other fertilising liquid, including ammonia, e.g. transport tanks, sprinkling wagons (watering fields in general A01G25/00; spraying or applying liquids or other fluent materials in general B05)",
  "A01D": "Lawn-mowers",
  "A01F": "Cutting apparatus specially adapted for cutting hay, straw or the like (mowers combined with means for cutting up the mown crop A01D43/08)",
  "A01G": "Cultivation of seaweed {or algae}",
  "A01H": "Symbiotic or parasitic combinations including one or more new plants, e.g. mycorrhiza (lichens A01H15/00)",
  "A01J": "Subject matter not provided for in other groups of this subclass",
  "A01K": "Animals characterised by purpose",
  "A01L": "Apparatus or use of substances for the care of hoofs",
  "A01M": "Kind of animal",
  "A01N": "Combinations or mixtures of active ingredients covered by classes A01N27/00 - A01N65/48 with other active or formulation relevant ingredients, e.g. specific carrier materials or surfactants, covered by classes A01N25/00 - A01N65/48",
  "A01P": "Chemosterilants",
  "A21B": "Baking plants",
  "A21C": "Apparatus for handling baked articles",
  "A21D": "Refreshing bakery products {or recycling bakery products}",
  "A22B": "Slaughterhouse arrangements",
  "A22C": "Processing shellfish {or bivalves}, e.g. oysters, lobsters; {Devices therefor, e.g. claw locks, claw crushers, grading devices; Processing lines}",
  "A23B": "Preservation of edible seeds, e.g. cereals",
  "A23C": "Aspects relating to packaging",
  "A23D": "Other edible oils or fats, e.g. shortenings, cooking oils",
  "A23F": "Special features",
  "A23G": "Products with special structure",
  "A23J": "Phosphatide compositions for foodstuffs, e.g. lecithin",
  "A23K": "Feeding-stuffs specially adapted for particular animals",
  "A23L": "Food or foodstuffs not provided for in groups A23L5/00 – A23L33/00; Preparation or treatment thereof",
  "A23N": "Apparatus specially adapted for preparing animal feeding-stuffs {(automatic devices for the distribution of liquid fodder for stock or game A01K5/0216; sucking apparatus for young stock A01K9/00)}",
  "A23P": "Shaping or working of foodstuffs characterised by the process or apparatus (A23P10/00, A23P20/00 take precedence)",
  "A23V": "Processes",
  "A23Y": "Propionibacterium",
  "A24B": "Chemical features or treatment of tobacco; Tobacco substitutes, e.g. in liquid form (A24B3/00 takes precedence)",
  "A24C": "Making cigarettes; Making tipping materials for, or attaching filters or mouthpieces to, cigars or cigarettes",
  "A24D": "Tobacco smoke filters, e.g. filter-tips, filtering inserts; Filters specially adapted for simulated smoking devices; Mouthpieces for cigars or cigarettes (for pipes, for cigar or cigarette holders A24F7/00)",
  "A24F": "Tobacco pipes; Bad-covers or accessories for smokers' pipes",
  "A41B": "Materials for shirts, underwear, baby linen or handkerchiefs not provided for in other groups of this subclass",
  "A41C": "Machines, appliances, or methods for manufacturing corsets or brassieres",
  "A41D": "Uses of garments specially adapted for specific purposes",
  "A41F": "Garment suspenders not otherwise provided for",
  "A41G": "Artificial feathers",
  "A41H": "Other methods, machines or appliances",
  "A42B": "Fastening means for head coverings; Elastic cords; Ladies' hat fasteners (hat-pins A44B9/06)",
  "A42C": "Subject matter not provided for in other groups of this subclass",
  "A43B": "Uppers; Boot legs; Stiffeners; Other single parts of footwear",
  "A43C": "Attachments for footwear, not provided for in other groups of this subclass",
  "A43D": "Subject matter not provided for in other groups of this subclass",
  "A44B": "Subject matter not provided for in other groups of this subclass",
  "A44C": "Making jewellery or other personal adornments",
  "A44D": "Accessories for fastening means",
  "A45B": "Details not otherwise provided for in A45B",
  "A45C": "Details not otherwise provided for in A45C",
  "A45D": "Details not otherwise provided for in A45D",
  "A45F": "Details not otherwise provided for in A45F",
  "A46B": "Brushes characterized by their functions, uses or applications",
  "A46D": "Subject matter not provided for in other groups of this subclass",
  "A47B": "Furniture jointing; Furniture with such jointing",
  "A47C": "Details or accessories for chairs, beds, or the like, not provided for in other groups of this subclass, e.g. upholstery fasteners, mattress protectors, stretching devices for mattress nets",
  "A47D": "Accessories for children's furniture, e.g. safety belts (holders for {baby bottles or} bottles for medicinal feeding A61J9/06; safety belts or body harnesses, in general A62B35/00; {infant exercisers attachable to play-pens, beds or cradles A63H33/006}; safety belts or body harnesses in land vehicles B60R22/00; harnessing in aircraft B64D25/06)",
  "A47F": "Shop or like accessories (devices for drawing-off and cutting paper from a roll B65H; movably-mounted ladders E06C9/06)",
  "A47G": "Details not otherwise provided for in A47G19/00-A47G23/16",
  "A47H": "Means for connecting curtains",
  "A47J": "Devices having filling level indicating means",
  "A47K": "Combinations of water taps, soap dispensers and hand dryers",
  "A47L": "Washing methods characterised by the use of a particular treatment",
  "A61B": "Medical imaging apparatus involving image processing or analysis (A61B1/00009, A61B6/52 and A61B8/52 take precedence; image processing per se G06T; details of algorithms for analysing medical images G06T7/0012)",
  "A61C": "Features not otherwise provided for",
  "A61D": "Subject matter not provided for in other groups of this subclass",
  "A61F": "Prostheses classified in A61F2/28 or A61F2/30 - A61F2/44 being constructed from or coated with a particular material",
  "A61G": "Adaptations of particular transporting means",
  "A61H": "Measuring physical parameters of the user",
  "A61J": "General identification or selection means",
  "A61K": "Properties of cosmetic compositions or active ingredients thereof or formulation aids used therein and process related aspects",
  "A61L": "Materials or treatment for tissue regeneration",
  "A61M": "Specially adapted for animals",
  "A61N": "Ultrasound therapy (lithotripsy A61B17/22, A61B17/225; massage using supersonic vibration A61H23/00  {; using ultrasound for introducing media into the body A61M37/0092})",
  "A61P": "Drugs for specific purposes, not provided for in groups A61P1/00-A61P41/00",
  "A61Q": "Cosmetics or similar toilet preparations for specific uses not provided for in other groups of this subclass",
  "A62B": "Subject matter not provided for in other groups of this subclass",
  "A62C": "Subject matter not provided for in other groups of this subclass",
  "A62D": "Aspects of processes for making harmful chemical substances harmless, or less harmful, by effecting chemical change in the substances",
  "A63B": "Sports without balls",
  "A63C": "Special features of skates, skis, roller-skates, snowboards and courts",
  "A63D": "Billiards, e.g. carom billiards or pocket billiards; Billiard tables (bagatelle A63D13/00)",
  "A63F": "Features of games using an electronically generated display having two or more dimensions, e.g. on a television screen, showing representations related to the game",
  "A63G": "Means for transporting or storing public amusement arrangements",
  "A63H": "Computerized interactive toys, e.g. dolls",
  "A63J": "Subject matter not provided for in other groups of this subclass",
  "A63K": "Subject matter not provided for in other groups of this subclass",
  "A99Z": "Subject matter not otherwise provided for in this section",
  "E01B": "Electrical insulation of railway track parts",
  "E01C": "Machine characteristics, parts or accessories not otherwise provided for",
  "E01D": "Material constitution of bridges",
  "E01F": "Safety arrangements for slowing, redirecting or stopping errant vehicles, e.g. guard posts or bollards; Arrangements for reducing damage to roadside structures due to vehicular impact (arrangements for fastening signs or signals to safety barriers or the like E01F9/669; for forcibly arresting vehicles E01F13/00)",
  "E01H": "Removing undesirable matter, e.g. rubbish, from the land, not otherwise provided for (gatherers for removing stones, roots or the like from the soil A01B43/00)",
  "E02B": "Devices, constructional details or methods of hydraulic engineering not otherwise provided for",
  "E02C": "Mechanisms for lifting ships vertically (salvaging sunken vessels B63C7/00)",
  "E02D": "Miscellaneous",
  "E02F": "Component parts of dredgers or soil-shifting machines, not restricted to one of the kinds covered by groups E02F3/00 - E02F7/00 (laying-out or take-up devices for trailing electric cables B66C)",
  "E03B": "Arrangements or adaptations of tanks for water supply (water-butts E03B3/03; storage aspects B65D, B65G, F17B, F17C; foundations E02D27/38; construction or assembling of bulk storage containers employing civil engineering techniques E04H7/00; tower aspects E04H12/00)",
  "E03C": "Details, devices or methods not otherwise provided for",
  "E03D": "Details and methods of use for water closets and urinals not otherwise provided for",
  "E03F": "Details, devices or methods not otherwise provided for",
  "E04B": "Material constitution of slabs, sheets or the like",
  "E04C": "Reinforcing elements, e.g. for concrete; Auxiliary elements therefor ({methods or devices for making reinforcing materials B21D}; material composition {C04B}, C21, C22; arrangements of reinforcing elements, see the relevant subclasses)",
  "E04D": "Apparatus or tools for roof working",
  "E04F": "Specially adapted covering, lining or flooring elements not otherwise provided for",
  "E04G": "Temporary arrangements for giving access from one level to another for men or vehicles, e.g. steps, ramps (for scaffolds E04G5/10; gangways B63; lifts B66)",
  "E04H": "Fencing, e.g. fences, enclosures, corrals (features peculiar to electrified fences A01K3/00, H05C; means for allowing passage through fences, barriers, or the like E06B11/00)",
  "E05B": "Details of vehicle locks not provided for in groups E05B77/00 - E05B83/00",
  "E05C": "Arrangements or combinations of wing fastening, securing, or holding devices, not covered by a single preceding main group; {Locking kits}",
  "E05D": "Hinges or other suspension devices especially for doors or windows",
  "E05F": "Operating mechanisms for sliding windows",
  "E05G": "Safes or accessories thereof",
  "E05Y": "Application of doors, windows, wings or fittings thereof",
  "E06B": "Means for allowing passage through fences, barriers or the like, e.g. stiles (general features of doors E06B1/00 - E06B9/00; {cattle grids A01K3/002; features peculiar to electrified wire fencing A01K3/005})",
  "E06C": "Ladders characterised by being permanently attached to fixed structures, e.g. fire escapes (movable stairways E04F11/04  {; means for facilitating access to swimming pools E04H4/144})",
  "E21B": "Special features related to earth drilling for obtaining oil, gas or water",
  "E21C": "Apparatus for, or methods of, winning materials from extraterrestrial sources (cosmonautics B64G)",
  "E21D": "Mine roof supports for step- by- step movement, e.g. in combination with provisions for shifting of conveyors, mining machines, or guides therefor ({transport of mine roof support units E21F13/008; } shifting of mine conveyors at the working face E21F13/08)",
  "E21F": "Methods or devices for use in mines or tunnels, not covered elsewhere (mine lighting F21, H05B)",
  "E99Z": "Subject matter not otherwise provided for in this section",
  "Y02A": "Technologies having an indirect contribution to adaptation to climate change",
  "Y02B": "Enabling technologies or technologies with a potential or indirect contribution to GHG emissions mitigation",
  "Y02C": "Capture or disposal of greenhouse gases",
  "Y02D": "Reducing energy consumption in communication networks",
  "Y02E": "Other energy conversion or management systems reducing GHG emissions",
  "Y02P": "Enabling technologies with a potential contribution to greenhouse gas [GHG] emissions mitigation",
  "Y02T": "Enabling technologies or technologies with a potential or indirect contribution to GHG emissions mitigation",
  "Y02W": "Enabling technologies or technologies with a potential or indirect contribution to greenhouse gas [GHG] emissions mitigation",
  "Y04S": "Market activities related to the operation of systems integrating technologies related to power network operation or related to communication or information technologies",
  "Y10S": "Nanotechnology",
  "Y10T": "Tool changing",
  "G01B": "Aspects of interferometers not specifically covered by any group under G01B9/02",
  "G01C": "Manufacturing, calibrating, cleaning, or repairing instruments or devices referred to in the other groups of this subclass (testing, calibrating or compensating compasses G01C17/38)",
  "G01D": "Indexing scheme relating to details of testing or calibration",
  "G01F": "Testing or calibrating apparatus for measuring volume, volume flow or liquid level, or for metering by volume",
  "G01G": "Auxiliary devices for weighing apparatus",
  "G01H": "Measuring mechanical vibrations or ultrasonic, sonic or infrasonic waves, not provided for in the preceding groups {(see provisionally also G01H1/00)}",
  "G01J": "Measuring the characteristics of individual optical pulses or of optical pulse trains",
  "G01K": "Thermometers with dedicated analog to digital converters",
  "G01L": "Testing or calibrating of apparatus for measuring fluid pressure",
  "G01M": "Subject matter not provided for in other groups of this subclass",
  "G01N": "Detection or diagnosis of diseases",
  "G01P": "Testing or calibrating of apparatus or devices covered by the preceding groups",
  "G01Q": "Scanning-probe techniques or apparatus not otherwise provided for",
  "G01R": "Testing or calibrating of apparatus covered by the other groups of this subclass",
  "G01S": "Position-fixing by co-ordinating two or more direction or position line determinations; Position-fixing by co-ordinating two or more distance determinations",
  "G01T": "Details of radiation-measuring instruments",
  "G01V": "Details of seismic processing or analysis",
  "G01W": "Real-time site-specific personalized weather information, e.g. nowcasting",
  "G02B": "Coding scheme for general features or characteristics of optical elements and systems of subclass G02B, but not including elements and systems which would be classified in G02B6/00 and subgroups",
  "G02C": "Generic optical aspects applicable to one or more of the subgroups of G02C7/00",
  "G02F": "Indexing scheme related to G02F1/13363, i.e. to birefringent elements, e.g. for optical compensation, characterised by the number, position, orientation or value of the compensation plates",
  "G03B": "Photographic printing apparatus",
  "G03C": "Details",
  "G03D": "Liquid processing apparatus involving immersion; washing apparatus involving immersion",
  "G03F": "Registration or positioning of originals, masks, frames, photographic sheets or textured or patterned surfaces, e.g. automatically (G03F7/22 takes precedence; preparation of photographic masks G03F1/00; within photographic printing apparatus for making copies G03B27/00)",
  "G03G": "Processes not provided for by group G03G2215/00, e.g. cleaning or residual charge elimination",
  "G03H": "Substrate bearing the hologram",
  "G04B": "Subject matter not provided for in other groups of this subclass",
  "G04C": "Subject matter not provided for in other groups of this subclass",
  "G04D": "Subject matter not provided for in other groups of this subclass",
  "G04F": "Apparatus for measuring unknown time intervals by means not provided for in groups G04F5/00 - G04F10/00",
  "G04G": "Subject matter not provided for in other groups of this subclass",
  "G04R": "Constructional details",
  "G05B": "Indexing scheme associated with group G05B23/00",
  "G05D": "Application",
  "G05F": "Regulating magnetic variables (details of apparatus for measuring magnetic variables involving magnetic resonance G01R33/28)",
  "G05G": "Control mechanisms or elements therefor applying a mechanical movement",
  "G06C": "Combinations of computing machines with other machines, e.g. with typewriter, with money-changing apparatus",
  "G06D": "Computing devices characterised by the combination of hydraulic or pneumatic functional elements with at least one other type of functional element",
  "G06E": "Devices not provided for in group G06E1/00, e.g. for processing analogue or hybrid data",
  "G06F": "Indexing scheme relating to security arrangements for protecting computers, components thereof, programs or data against unauthorised activity",
  "G06G": "Subject matter not provided for in other groups of this subclass",
  "G06J": "Systems for conjoint operation of complete digital and complete analogue computers",
  "G06K": "Arrangements for producing a permanent visual presentation of the output data",
  "G06M": "Indexing scheme relating to counting of objects carried by a conveyor",
  "G06N": "Subject matter not provided for in other groups of this subclass",
  "G06Q": "Postage metering systems",
  "G06T": "Indexing scheme for manipulating 3D models or images for computer graphics",
  "G07B": "Franking apparatus (printing aspects B41)",
  "G07C": "Indexing scheme relating to groups G07C9/00 - G07C9/38",
  "G07D": "Paper-money handling devices",
  "G07F": "Complete banking systems; Coded card-freed arrangements adapted for dispensing or receiving monies or the like and posting such transactions to existing accounts, e.g. automatic teller machines (data processing equipment for bank accounting G06Q40/02)",
  "G07G": "Receipt-giving machines (cash registers giving receipts G07G1/00)",
  "G08B": "Predictive alarm systems characterised by extrapolation or other computation using updated historic data",
  "G08C": "Transmission systems of control signals via wireless link",
  "G08G": "Subject matter not provided for in other groups of this subclass",
  "G09B": "Maps; Plans; Charts; Diagrams, e.g. route diagram (star maps G09B27/04; devices for holding or supporting maps A47B97/02; for computing purposes G06G1/14, G09B1/16; display boards G09F)",
  "G09C": "Ciphering apparatus or methods not provided for in the preceding groups, e.g. involving the concealment or deformation of graphic data such as designs, written or printed messages",
  "G09D": "Perpetual calendars",
  "G09F": "Combined visual and audible advertising or displaying, e.g. for public address",
  "G09G": "Specific applications",
  "G10B": "Details or accessories",
  "G10C": "Methods, tools or materials specially adapted for the manufacture or maintenance of musical instruments covered by this subclass",
  "G10D": "Musical instruments not otherwise provided for",
  "G10F": "Details or accessories",
  "G10G": "Other auxiliary devices or accessories, e.g. conductors' batons or separate holders for resin or strings",
  "G10H": "Aspects of algorithms or signal processing methods without intrinsic musical character, yet specifically adapted for or used in electrophonic musical processing (methods with intrinsic musical character G10H2210/00)",
  "G10K": "Details of active noise control [ANC] covered by G10K11/178 but not provided for in any of its subgroups",
  "G10L": "Subject matter not provided for in other groups of this subclass",
  "G11B": "Record carriers by type",
  "G11C": "Indexing scheme relating to checking stores for correct operation, subsequent repair or testing stores during standby or offline operation",
  "G12B": "Screening (insulation or other protection of buildings E04B; emergency protection of apparatus in general F16P7/00; in connection with acoustic waves G10K11/00; in connection with nuclear radiation G21F)",
  "G16B": "Subject matter not provided for in other groups of this subclass",
  "G16C": "Subject matter not provided for in other groups of this subclass",
  "G16H": "ICT specially adapted for facilitating communication between medical practitioners or patients, e.g. for collaborative diagnosis, therapy or health monitoring",
  "G16Y": "IoT characterised by the purpose of the information processing",
  "G16Z": "Subject matter not provided for in other main groups of this subclass",
  "G21B": "Low temperature nuclear fusion reactors, e.g. alleged cold fusion reactors",
  "G21C": "Adaptations of reactors to facilitate experimentation or irradiation",
  "G21D": "Arrangements to provide heat for purposes other than conversion into power, e.g. for heating buildings",
  "G21F": "Treating radioactively contaminated material; Decontamination arrangements therefor",
  "G21G": "Conversion of chemical elements not provided for in other groups of this subclass",
  "G21H": "Use of effects of cosmic radiation",
  "G21J": "Detection arrangements for nuclear explosions (individual measuring devices G01)",
  "G21K": "Particular details of imaging devices or methods using ionizing electromagnetic radiation such as X-rays or gamma rays",
  "G99Z": "Subject matter not otherwise provided for in this section",
  "F01B": "Accessories of steam engines; Arrangements or control devices of piston pumps, compressors without crank shafts or condensors for so far as they influence the functioning of the engines",
  "F01C": "Component parts, details or accessories not provided for in groups F01C1/00 - F01C20/00",
  "F01D": "Component parts, details, or accessories, not provided for in, or of interest apart from, other groups",
  "F01K": "Plants for converting heat or fluid energy into mechanical energy, not otherwise provided for",
  "F01L": "Details on specific features characterising valve gear arrangements",
  "F01M": "Measuring",
  "F01N": "Details of electrical control or of the monitoring of the exhaust gas treating apparatus",
  "F01P": "Details",
  "F02B": "Internal combustion engines with pistons rotating or oscillating with relation to the housing",
  "F02C": "Controlling gas-turbine plants; Controlling fuel supply in air- breathing jet-propulsion plants (controlling air intakes F02C7/057; controlling turbines F01D; controlling compressors F04D27/00; controlling in general G05)",
  "F02D": "Mechanical control of speed or power of a single cylinder piston engine",
  "F02F": "Manufacturing",
  "F02G": "Engines characterised by the use of a particular power transfer medium, e.g. Helium",
  "F02K": "Subject matter not provided for in other groups of this subclass",
  "F02M": "Supplying, feeding or preparing air, fuel, fuel air mixtures or auxiliary fluids for a combustion engine; Use of exhaust gas; Compressors for piston engines",
  "F02N": "Control related aspects of engine starting",
  "F02P": "Other ignition",
  "F03B": "Other machines or engines",
  "F03C": "Subject matter not provided for in other groups of this subclass",
  "F03D": "Details, components or accessories not provided for in groups F03D1/00 - F03D17/00",
  "F03G": "Mechanical-power-producing mechanisms, not otherwise provided for or using energy sources not otherwise provided for",
  "F03H": "Subject matter not provided for in other groups of this subclass",
  "F04B": "External parameters",
  "F04C": "Arrangements for preventing or removing deposits or corrosion",
  "F04D": "Pumps producing waves in liquids, i.e. wave-producers (for bath tubs A47K3/10)",
  "F04F": "Subject matter not provided for in other groups of this subclass",
  "F05B": "Materials; Properties thereof",
  "F05C": "Other material characteristics; Treatment of material",
  "F05D": "Materials; Properties thereof",
  "F15B": "Fluid-actuated devices for displacing a member from one position to another",
  "F15C": "Hybrid elements, i.e. circuit elements having features according to groups F15C1/00 and F15C3/00",
  "F15D": "Influencing flow of fluids",
  "F16B": "Constructional details of connections not covered for in other groups of this subclass",
  "F16C": "Electrical apparatus (in general H01 - H05)",
  "F16D": "External control of clutches by electric or electronic means",
  "F16F": "Type of springs or dampers",
  "F16G": "Hooks as integral parts of chains (hooks for cranes B66C1/34; hooks in general F16B45/00)",
  "F16H": "Different types of speed-change gear mechanisms",
  "F16J": "Sealings",
  "F16K": "Details of valves",
  "F16L": "Special arrangements for pipe couplings",
  "F16M": "Details of stands or supports",
  "F16N": "Valves",
  "F16P": "Emergency devices preventing damage to a machine or apparatus (F16P1/00, F16P3/00, F16P5/00 take precedence; indicating means, see the appropriate classes)",
  "F16S": "Other constructional members not restricted to an application fully provided for in a single class",
  "F16T": "Steam traps or like apparatus for draining-off liquids from enclosures predominantly containing gases or vapours, e.g. gas lines, steam lines, containers",
  "F17B": "Gas-holders of variable capacity (large containers in general B65D88/00; storing fluids in natural or artificial cavities or chambers in the earth B65G5/00)",
  "F17C": "Applications",
  "F17D": "Protection or supervision of installations (arrangements for protecting foundations E02D31/00; protecting pipes from damage or internal or external wear F16L57/00, against corrosion and scale F16L58/00; investigation of the fluid-tightness of structures G01M3/00)",
  "F21H": "Other incandescent bodies",
  "F21K": "Subject matter not provided for in other groups of this subclass",
  "F21L": "Lighting devices or systems, employing combinations of electric and non-electric light sources; Replacing or exchanging electric light sources with non-electric light sources or vice versa in lighting devices or systems",
  "F21S": "Arrangements within vehicle lighting devices specially adapted for vehicle exteriors, for purposes other than emission or distribution of light",
  "F21V": "Use of light guides, e.g. fibre optic devices, in lighting devices or systems",
  "F21W": "Use or application of lighting devices or systems not provided for in codes F21W2102/00-F21W2121/00",
  "F21Y": "Light-generating elements of semiconductor light sources",
  "F22B": "Component parts or details of steam boilers (venting devices F16K24/00; steam traps or like apparatus F16T)",
  "F22D": "Feed-water supply not provided for in other main groups",
  "F22G": "Steam superheaters characterised by location, arrangement, or disposition",
  "F23B": "Special features of, or arrangements for combustion apparatus using solid fuels; Combustion processes therefor",
  "F23C": "Special features of, or arrangements for combustion apparatus using fluid fuels or solid fuels suspended in air; Combustion processes therefor",
  "F23D": "Special features of, or arrangements for burners using fluid fuels or solid fuels suspended in a carrier gas",
  "F23G": "Special features of, or arrangements for incinerators",
  "F23H": "Special features of combustion grates",
  "F23J": "Special arrangements for conducting or purifying combustion fumes; Treatment of fumes or ashes",
  "F23K": "Special features of, or arrangements for fuel supplies",
  "F23L": "Special arrangements for supplying or treating air or oxidant for combustion; Injecting inert gas, water or steam into the combustion chamber",
  "F23M": "Special features of, or arrangements for combustion chambers",
  "F23N": "Special features of, or arrangements for controlling combustion",
  "F23Q": "Extinguishing-devices, e.g. for blowing-out or snuffing candle flames (for cigarettes A24F)",
  "F23R": "Special features of, or arrangements for continuous combustion chambers; Combustion processes therefor",
  "F24B": "Implements for use in connection with stoves or ranges",
  "F24C": "Details",
  "F24D": "Characterizing positions, e.g. of sensors, inlets, outlets",
  "F24F": "Details or features not otherwise provided for",
  "F24H": "Electrical heat generating means",
  "F24S": "Prediction; Simulation",
  "F24T": "Prediction; Simulation",
  "F24V": "Subject matter not provided for in other main groups of this subclass",
  "F25B": "Sensing or detecting of parameters; Sensors therefor",
  "F25C": "Sensing or detecting of parameters; Sensors therefor",
  "F25D": "Means for sensing or measuring; Sensors therefor",
  "F25J": "Other details not covered by groups F25J2200/00 - F25J2280/00",
  "F26B": "Drying processes and machines for solid objects characterised by the specific requirements of the drying good",
  "F27B": "Open or uncovered sintering apparatus; Other heat-treatment apparatus of like construction",
  "F27D": "Manipulation of furnace parts",
  "F27M": "Type of treatment of the charge",
  "F28B": "Controlling arrangements with features specially adapted for condensers (control arrangements in general G05)",
  "F28C": "Other direct-contact heat-exchange apparatus",
  "F28D": "Heat-exchange apparatus not covered by any of the groups F28D1/00 - F28D20/00",
  "F28F": "Mounting arrangements; Arrangements for facilitating assembling or disassembling of heat exchanger parts",
  "F28G": "Details (measuring thickness of deposit G01B)",
  "F41A": "Subject matter not provided for in other groups of this subclass",
  "F41B": "Weapons not otherwise provided for {, e.g. nunchakus, throwing knives}",
  "F41C": "Means for wearing or carrying smallarms",
  "F41F": "Launching-apparatus for projecting missiles or projectiles otherwise than from barrels, {e.g. using spigots}(F41F3/04 takes precedence; {centrifugal sling apparatus F41B3/04})",
  "F41G": "Details of sighting or aiming apparatus; Accessories {(tools for adjustment of sights F41G1/545)}",
  "F41H": "Means of attack or defence not otherwise provided for {(details of radar or sonar systems G01S7/00)}",
  "F41J": "Bullet catchers",
  "F42B": "Subject matter not provided for in other groups of this subclass",
  "F42C": "Subject matter not provided for in other groups of this subclass",
  "F42D": "Subject matter not provided for in other groups in this subclass",
  "F99Z": "Subject matter not otherwise provided for in this section",
  "H01B": "Apparatus or processes specially adapted for manufacturing insulators or insulating bodies {(manufacture of porcelain for electric insulation C04B33/26)}",
  "H01C": "Apparatus or processes specially adapted for manufacturing resistors (providing fillings for housings or enclosures H01C1/02; reducing insulation surrounding a resistor to powder H01C1/03; manufacture of thermally variable resistors H01C7/02, H01C7/04)",
  "H01F": "Apparatus or processes specially adapted for manufacturing or assembling magnets, inductances or transformers; Apparatus or processes specially adapted for manufacturing materials characterised by their magnetic properties",
  "H01G": "Structural combinations of capacitors or other devices covered by at least two different main groups of this subclass with other electric elements, not covered by this subclass, e.g. RC combinations",
  "H01H": "Orthogonal indexing scheme relating to electric switches, relays, selectors or emergency protective devices covered by H01H",
  "H01J": "Discharge tubes and lamps",
  "H01K": "Lamps having an incandescent body which is substantially non-conductive until heated, e.g. Nernst lamp",
  "H01L": "Details relating to devices covered by the group H01L33/00 but not provided for in its subgroups",
  "H01M": "Electrolytes",
  "H01P": "Apparatus or processes specially adapted for manufacturing waveguides or resonators, lines, or other devices of the waveguide type",
  "H01Q": "Antennas or antenna systems providing at least two radiating patterns (arrangements for changing or varying the orientation or the shape of the directional pattern H01Q3/00)",
  "H01R": "Connectors or connections adapted for particular applications",
  "H01S": "Special growth methods for semiconductor lasers",
  "H01T": "Apparatus for generating ions to be introduced into non-enclosed gases, e.g. into the atmosphere",
  "H02B": "Supervisory desks or panels for centralised control or display (desks in general A47B)",
  "H02G": "Indexing scheme relating to installation of electric cables or lines covered by H02G",
  "H02H": "Emergency protective circuit arrangements for preventing the switching-on in case an undesired electric working condition might result",
  "H02J": "The network for supplying or distributing electric power characterised by its spatial reach or by the load",
  "H02K": "Specific aspects not provided for in other groups of this subclass relating to methods or apparatus specially adapted for manufacturing, assembling, maintaining or repairing of dynamo-electric machines",
  "H02M": "Power conversion systems not covered by the preceding groups",
  "H02N": "Subject matter not provided for in other groups of this subclass",
  "H02P": "Indexing scheme relating to controlling arrangements characterised by the waveform of the supplied voltage or current",
  "H02S": "Subject matter not provided for in other groups of this subclass",
  "H03B": "Aspects of oscillators relating to reduction of undesired oscillations",
  "H03C": "Indexing scheme relating to details of modulators or modulation methods covered by H03C",
  "H03D": "Indexing scheme relating to details of demodulation or transference of modulation from one carrier to another covered by H03D",
  "H03F": "Indexing scheme relating to amplifiers with only discharge tubes or only semiconductor devices as amplifying elements covered by H03F3/00",
  "H03G": "Indexing scheme relating to subclass H03G",
  "H03H": "Theory relating to impedance networks",
  "H03J": "Indexing scheme relating to tuning resonant circuits and selecting resonant circuits",
  "H03K": "Indexing scheme related to electronic switching or gating, i.e. not by contact-making or -breaking covered by H03K17/00",
  "H03L": "Indexing scheme relating to automatic control of frequency or phase and to synchronisation",
  "H03M": "Subject matter not provided for in other groups of this subclass",
  "H04B": "Reducing interference at the transmission system level",
  "H04H": "Aspects of broadcast communication",
  "H04J": "Orthogonal indexing scheme relating to orthogonal multiplex systems",
  "H04K": "Jamming of communication; Countermeasures",
  "H04L": "Additional details relating to network architectures or network communication protocols for network security covered by H04L63/00",
  "H04M": "Details of telephonic subscriber devices",
  "H04N": "Details of stereoscopic systems",
  "H04Q": "Indexing scheme relating to selecting arrangements in general and for multiplex systems",
  "H04R": "Aspects covered by H04R or H04S not otherwise provided for in their subgroups",
  "H04S": "Techniques used stereophonic systems covered by H04S but not provided for in its groups",
  "H04T": "Standards related to data transmission protocols not covered by any of the codes H04T2001/00 - H04T2012/00",
  "H04W": "Subject matter not provided for in other groups of this subclass",
  "H05B": "Aspects relating to resistive heating, induction heating and heating using microwaves, covered by groups H05B3/00, H05B6/00",
  "H05C": "Other circuits",
  "H05F": "Use of naturally-occurring electricity, {e.g. lightning or static electricity}",
  "H05G": "Apparatus or processes specially adapted for producing X-rays, not involving X-ray tubes, e.g. involving generation of a plasma (X-ray lasers H01S4/00; plasma technique in general H05H)",
  "H05H": "Applications of particle accelerators",
  "H05K": "dummy group",
  "H99Z": "Subject matter not otherwise provided for in this section",
  "B01B": "Boiling; Boiling apparatus for physical or chemical purposes {; Evaporation in general}",
  "B01D": "Details relating to properties of membranes",
  "B01F": "Auxiliary or complementary information in relation with mixing",
  "B01J": "Compositional aspects of coordination complexes or ligands in catalyst systems",
  "B01L": "Moving or stopping fluids",
  "B02B": "Auxiliary devices",
  "B02C": "Codes relating to different types of disintegrating devices",
  "B03B": "Control arrangements specially adapted for wet-separating apparatus or for dressing plant, using physical effects (detecting, measuring, or analysing devices G01; control devices in general G05)",
  "B03C": "Details of magnetic or electrostatic separation",
  "B03D": "Specified materials treated by the flotation agents; specified applications (paper pulp processing D21F1/70, de-inking of paper pulp D21B1/325)",
  "B04B": "Other accessories for centrifuges",
  "B04C": "Accessories, e.g. safety or control devices, not otherwise provided for {, e.g. regulators, valves in inlet or overflow ducting}(with electrostatic precipitating arrangements B03C3/14)",
  "B05B": "Apparatus for spraying or atomising liquids or other fluent materials, not covered by the preceding groups (dropping or releasing powdered, liquid or gaseous matter in flight B64D1/16)",
  "B05C": "Accessories or implements for use in connection with applying liquids or other fluent materials to surfaces, not provided for in groups B05C1/00 - B05C19/00 (accessories or implements for use in connection with painting or artistic drawing and fully provided for in B44D3/02 - B44D3/38, see subgroups of B44D3/00)",
  "B05D": "Coatings being able to withstand changes in the shape of the substrate or to withstand welding",
  "B06B": "Indexing scheme associated with B06B1/0207 for details covered by B06B1/0207 but not provided for in any of its subgroups",
  "B07B": "Specific aspects relating to the whole B07B subclass",
  "B07C": "Sorting according to a characteristic or feature of the articles or material to be sorted",
  "B08B": "Type of materials or objects being cleaned",
  "B09B": "Type of waste materials treated",
  "B09C": "In situ",
  "B21B": "Mill drive parameters",
  "B21C": "Subject matter not provided for in other groups of this subclass",
  "B21D": "Safety devices protecting the machine or the operator, specially adapted for apparatus or machines dealt with in this subclass (for presses in general B30B; safety devices in general F16P)",
  "B21F": "Subject matter not provided for in other groups of this subclass",
  "B21G": "Making pins of U-like shape or split-pins (of paper fasteners or staples B21D53/46, B21F45/16)",
  "B21H": "Feeding arrangements for rolling machines or apparatus manufacturing articles dealt with in this subclass",
  "B21J": "Blacksmiths requisites not otherwise provided for",
  "B21K": "Control devices specially adapted for positioning tool carriers",
  "B21L": "Subject matter not provided for in other groups of this subclass",
  "B22C": "Foundry moulding plants (for preparing mould materials B22C5/18; in combination with casting plants B22D47/02)",
  "B22D": "Casting plants",
  "B22F": "Aspects linked to processes or compositions used in powder metallurgy",
  "B23B": "Details of turning, boring or drilling machines, processes or tools not otherwise provided for",
  "B23C": "Details of milling machines, milling processes or milling tools not otherwise provided for",
  "B23D": "Reaming tools",
  "B23F": "Accessories or equipment combined with or arranged in, or specially designed to form part of, gear-cutting machines (tool-guiding mechanisms, see the relevant groups for making gear teeth; accessories or equipment not restricted to gear-cutting machines B23Q)",
  "B23G": "Details of equipment for threading other than threading tools, details of the threading process",
  "B23H": "Machining conditions",
  "B23K": "Materials to be soldered, welded or cut",
  "B23P": "Indexing scheme relating to the articles being treated, e.g. manufactured, repaired, assembled, connected or other operations covered in the subgroups",
  "B23Q": "Control systems or devices for copying from a pattern or master model",
  "B24B": "Devices for feeding, applying, grading or recovering grinding, polishing or lapping agents (for abrasive blasting B24C1/00, B24C7/00)",
  "B24C": "Selection of abrasive materials {or additives} for abrasive blasts (polishing compositions C09G)",
  "B24D": "Grinding tools with incorporated marking device",
  "B25B": "Hand tools not covered by any other group in this subclass",
  "B25C": "Nail straightening devices",
  "B25D": "General details of portable percussive tools; Components used in portable percussive tools",
  "B25F": "Details or components of portable power-driven tools not particularly related to the operations performed and not otherwise provided for",
  "B25G": "Attaching handles to the implements",
  "B25H": "Marking-out or setting-out work (measuring, gauging G01; optical apparatus G02B; by photographic means G03C)",
  "B25J": "Chambers provided with manipulation devices (constructional features of the mounting of the manipulator in the wall B25J1/08  {; glove-boxes for nuclear applications G21F7/04})",
  "B26B": "Guards or sheaths {or guides} for hand cutting tools; Arrangements for guiding hand cutting tools (guards for hair clippers or dry shavers B26B19/38)",
  "B26D": "Machines or methods used for cutting special materials",
  "B26F": "Perforating, punching, cutting-out, stamping-out, severing by means other than cutting of specific products",
  "B27B": "Sawing tools for saw mills, sawing machines, or sawing devices",
  "B27C": "Multi-purpose machines; Universal machines; Equipment therefor",
  "B27D": "Other working of veneer or plywood specially adapted to veneer or plywood (working of strips in the same way as cane B27J {; repairing tears on veneer blanks B27D1/10; B27G1/00 takes precedence})",
  "B27F": "Nailing or stapling; Nailed or stapled work",
  "B27G": "Gauging means specially designed for adjusting of tools or guides, e.g. adjusting cutting blades in cutter blocks ({B23Q17/22 takes precedence; boring templates B23B49/02}; for guides of sawing machines B27B27/00)",
  "B27H": "Manufacture of wood-rimmed wheels, e.g. cart wheels, steering wheels {(B23B3/265, B23B5/38, B23B41/06 take precedence)}",
  "B27J": "Mechanical working of tree or plant materials not otherwise provided for",
  "B27K": "Purpose of the treatment",
  "B27L": "Manufacture of wood shavings, chips, powder, or the like (disintegrating in general B02C; edge trimming sawing blades or sawing tools combined with means to disintegrate waste B27B33/20; obtaining fibres for spinning D01B1/00; wet methods D21B1/12); Tools therefor",
  "B27M": "Manufacture or reconditioning of specific semi-finished or finished articles (features of copying devices B23Q; manufacture of plywood or veneer, shaping plywood or veneer into articles B27D; of central layers for plywood B27D1/06; nailing or stapling machines in general B27F7/00; of elements for cooperage or wheel making B27H {; presses therefor B27D3/00})",
  "B27N": "Arrangements for fireproofing (fireproofing materials C09K21/00)",
  "B28B": "Arrangements specially adapted for the production of shaped articles with elements wholly or partly embedded in the moulding material; {Production of reinforced objects}(B28B21/00 takes precedence; in units for prefabricated buildings B28B7/22)",
  "B28C": "General arrangement or layout of plant {(B28C7/0061, B28C7/0481 take precedence)}",
  "B28D": "Accessories specially adapted for use with machines or devices of the preceding groups {(B28D5/0058 takes precedence)}",
  "B29B": "Indexing scheme related to making preforms for blow-moulding bottles or the like",
  "B29C": "Blow moulding, i.e. blowing a preform or parison to a desired shape within a mould",
  "B29D": "Subject matter not provided for in other groups of this subclass",
  "B29K": "Properties of moulding materials, reinforcements, fillers, preformed parts or moulds",
  "B29L": "Other particular articles",
  "B30B": "Details of, or accessories for, presses; Auxiliary measures in connection with pressing (safety devices F16P)",
  "B31B": "Manual operations for making bags or boxes",
  "B31C": "{Making wound articles not otherwise provided for}",
  "B31D": "Multiple-step processes for making three-dimensional articles",
  "B31F": "Mechanical deformation of paper or cardboard without removing material",
  "B32B": "Walls, panels",
  "B33Y": "Subject matter not provided for in other groups of this subclass",
  "B41B": "Control, indicating, or safety devices or systems for composing machines of various kinds or types (computers in general G06F)",
  "B41C": "Preparation or type or constituents of the imaging layers, in relation to lithographic printing forme preparation",
  "B41D": "Subject matter not provided for in other groups of this subclass",
  "B41F": "Cleaning arrangements or devices {(in manifolding apparatus or the like B41L41/00)}",
  "B41G": "Auxiliary perforating apparatus associated with printing devices (apparatus or machines for carrying-out printing operations combined with operations other than perforating B41F19/00)",
  "B41J": "Embodiments of or processes related to the control of the printing process",
  "B41K": "Subject matter not provided for in other groups of this subclass",
  "B41L": "Accessories or attachments for addressographs or like series-printing machines",
  "B41M": "Printing methods or features related to printing methods; Location or type of the layers",
  "B41N": "Location or type of the layers in multi-layer blankets or like coverings",
  "B41P": "Manifolding, printing or duplicating for office purposes",
  "B42B": "Devices common to machines for carrying out the processes according to more than one of the preceding main groups (auxiliary equipment in making paper articles B31F; auxiliary equipment in printing machines B41; conveyors in general B65G; {handling sheets in general B65H})",
  "B42C": "Subject matter not provided for in other groups of this subclass",
  "B42D": "Nature or shape of the markings provided on identity, credit, cheque or like information-bearing cards",
  "B42F": "Filing appliances not provided for in other groups of this subclass",
  "B42P": "Manufacturing; Forming",
  "B43K": "Writing implement receptacles functioning as, or combined with, writing implements (other writing implement receptacles A45C11/34, A45C11/36)",
  "B43L": "Ink stands",
  "B43M": "Subject matter not provided for in other groups of this subclass",
  "B44B": "Machines, apparatus, tools or accessories for artistic work",
  "B44C": "Paperhanging",
  "B44D": "Preserving paintings, e.g. by varnishing",
  "B44F": "Subject matter not provided for in other groups of this subclass",
  "B60B": "Purpose of invention",
  "B60C": "Tyres specially adapted for particular applications",
  "B60D": "{Other connections}",
  "B60F": "Retractable wheels",
  "B60G": "Indexing codes relating to the type of movement or to the condition of the vehicle and to the end result to be achieved by the control action",
  "B60H": "Other air-treating devices",
  "B60J": "Removable external protective coverings specially adapted for vehicles or parts of vehicles, e.g. parking covers (covering of load on vehicles B60P7/00; guard strips for body finishing, identifying or decorating B60R13/04; tents for use as garages E04H15/00)",
  "B60K": "Control devices, wherein the control is combined with or mainly influenced by the working of the engine or the main coupling, e.g. control device is linked to the carburettor control and is influenced by depression of pedal, for semi-automatic or non-automatic transmission having toothed wheels",
  "B60L": "Problem solutions or means not otherwise provided for",
  "B60M": "Specific problems related to power supply lines not otherwise provided for",
  "B60N": "General mechanical or structural details",
  "B60P": "Other vehicles predominantly for carrying loads {, e.g. load carrying vehicles convertible for an intended purpose}",
  "B60Q": "Features of lamps not covered by other groups in B60Q",
  "B60R": "Indexing scheme relating to vehicle anti-theft devices",
  "B60S": "Vehicle-manoeuvring devices separate from the vehicle (vehicle lifting {, e.g. liftable turntables} or pushing devices B66F; {workshop equipment B25H})",
  "B60T": "Further aspects of brake control systems not otherwise provided for",
  "B60V": "Land vehicles, waterborne vessels, or aircraft, adapted or modified to travel on air cushions",
  "B60W": "Indexing codes relating to the purpose of, or problem solved of road vehicle drive control systems not otherwise provided for in groups B60W30/00",
  "B60Y": "Constructional features of vehicle sub-units",
  "B61B": "Combinations of railway systems",
  "B61C": "Arrangement or disposition of parts; Details or accessories not otherwise provided for; Use of control gear and control systems",
  "B61D": "Other details",
  "B61F": "Subject matter not provided for in other groups of this subclass",
  "B61G": "Buffers (springs F16F)",
  "B61H": "Wear-compensating mechanisms, e.g. slack adjusters",
  "B61J": "Subject matter not provided for in other groups of this subclass",
  "B61K": "Other auxiliaries or accessories for railways (safety belts or harnesses A62B35/00)",
  "B61L": "Vehicle systems",
  "B62B": "Manufacturing; Constructional features",
  "B62C": "Safeguarding appliances not otherwise provided for, e.g. for readily releasing unmanageable draught animals",
  "B62D": "Systematic disassembly of vehicles for recovery of salvageable components, e.g. for recycling (for disposal of vehicles by destroying or transformation B09B3/00, B09B5/00 {; general arrangement of separating plants B03B9/00; recovery of plastics B29B17/00})",
  "B62H": "Supports or stands for two-wheel vehicles",
  "B62J": "Subject matter not provided for in other groups of this subclass",
  "B62K": "Quick release mechanisms adapted for cycles",
  "B62L": "Brakes, or actuating mechanisms therefor, controlled by back-pedalling (free-wheel devices specially adapted for cycles F16D41/00)",
  "B62M": "Ground engaging propulsion devices for cycles, sledges, or rider-propelled wheeled vehicles, not otherwise provided for {(non-motorized scooters with skis or runners B62K3/002)}",
  "B63B": "Design characteristics",
  "B63C": "Storing of vessels on land otherwise than by dry-docking",
  "B63G": "Other offensive or defensive arrangements on vessels; Vessels characterised thereby",
  "B63H": "Steering; Slowing-down otherwise than by use of propulsive elements (using movably-installed outboard propulsion units B63H20/00); Dynamic anchoring, i.e. positioning vessels by means of main or auxiliary propulsive elements",
  "B63J": "Subject matter not provided for in other groups of this subclass",
  "B64B": "Hybrid airships, i.e. airships where lift is generated aerodynamically and statically",
  "B64C": "Boundary layer controls",
  "B64D": "NACA type air intakes",
  "B64F": "Designing, manufacturing, assembling, cleaning, maintaining or repairing aircraft, not otherwise provided for; Handling, transporting, testing or inspecting aircraft components, not otherwise provided for",
  "B64G": "Space travel; artificial satellites; space exploration",
  "B65B": "Aspects of the final package",
  "B65C": "Details of manually controlled or manually operable label dispensers",
  "B65D": "Component parts, details or accessories for large containers",
  "B65F": "Materials of refuse receptacles",
  "B65G": "Indexing codes relating to loading or unloading articles or bulk materials",
  "B65H": "Application field",
  "B66B": "Aspects of control systems of elevators",
  "B66C": "Cranes",
  "B66D": "Capstans, winches or hoists",
  "B66F": "Lifting apparatus",
  "B67B": "Indexing codes relating to constructional features of closing machines",
  "B67C": "Funnels, e.g. for liquids (filter funnels B01D23/28; volume flow-meters G01F)",
  "B67D": "Indexing scheme relating to aspects and details of apparatus or devices for dispensing beverages on draught or for controlling flow of liquids under gravity from storage containers for dispensing purposes",
  "B68B": "Subject matter not provided for in other groups of this subclass",
  "B68C": "Covers for animals when working, e.g. for protecting",
  "B68F": "Machines or equipment specially adapted for saddle-making (methods B68F1/00)",
  "B68G": "Auxiliary devices and tools specially for upholstery",
  "B81B": "Microstructural systems or auxiliary parts thereof",
  "B81C": "Apparatus specially adapted for the manufacture or treatment of microstructural devices or systems",
  "B82B": "Manufacture or treatment of nanostructures by manipulation of individual atoms or molecules, or limited collections of atoms or molecules as discrete units",
  "B82Y": "Subject matter not provided for in other groups of this subclass",
  "B99Z": "Subject matter not otherwise provided for in this section"
}